all_buses = {
"1" : [
"Автобаза",
"Стадион Жастар",
"Улица Аксай",
"Улица Мухамеджана Сералина",
"Улица Сатпаева",
"Спутник",
"Улица Некрасова",
"Промкомбинат",
"Улица Астана",
"Улица Туякбаева",
"Базар",
"Акимат",
"Автостанция",
"Талмед",
"Улица Абая",
"Казахская улица",
"Улица Калдаякова",
"Магазин Фортуна",
"Улица Ауэзова",
"Алмалык",
"Байбулак"
],

"2" : [
"Талгар - Школа № 25",
"Поворот на мечеть Нуржау",
"Улица Островского",
"Улица Крылова",
"Переулок Наурызым",
"Улица Айвазовского",
"Гимназия № 8",
"Улица Курмангазы",
"Церковь",
"Акимат",
"Улица Курмангазы",
"Церковь",
"Акимат",
"Улица Ломоносова",
"4G+",
"Управление государственных доходов",
"Цон",
"Улица Адильхана",
"Ясли-сад № 7",
"Поликлиника"
],

"3" : [
"Азат",
"Улица Чкалова",
"Школа",
"Улица Илахуна Коккоза",
"Улица Седова",
"Спиртзавод",
"Улица Аксай",
"Улица Мухамеджана Сералина",
"Улица Сатпаева",
"Спутник",
"Улица Некрасова",
"Промкомбинат",
"Улица Астана",
"Улица Туякбаева",
"Базар",
"Акимат",
"Автостанция",
"Талмед",
"Улица Абая",
"Казахская улица",
"Село Арман",
"Улица Астана",
"Улица Жабаева",
"Улица Хасанова",
"Кызылкайрат"
],

"5" : [
"Продуктовый магазин",
"По требованию",
"Улица Маметовой",
"Магазин смешанных товаров",
"Автобаза",
"Магазин Елена",
"Школа № 6",
"Улица Карасай батыра",
"Аптека",
"Спутник",
"Улица Некрасова",
"Промкомбинат",
"Улица Астана",
"Улица Туякбаева",
"Базар",
"Акимат",
"Автостанция",
"Талмед",
"Улица Бокина",
"Управление государственных доходов",
"Цон",
"Школа № 3",
"Улица Абая",
"Казахская улица",
"Село Арман",
"Улица Астана",
"Улица Жабаева",
"Улица Хасанова",
"Кызылкайрат",
"Талдыбулак",
"Рысқұлов көшесі",
"Улица Ауэзова",
"Магазин Акмарал",
"Мечеть Дейылда ана"
],

"6" : [
"Спиртзавод",
"Улица Аксай",
"Улица Мухамеджана Сералина",
"Улица Сатпаева",
"Спутник",
"Улица Некрасова",
"Промкомбинат",
"Улица Астана",
"Улица Туякбаева",
"Базар",
"Акимат",
"Автостанция",
"Талмед",
"Улица Бокина",
"Управление государственных доходов",
"Цон",
"Школа № 3",
"Улица Маргулана",
"Магазин Аида",
"Детско-юношеская спортивная школа №2",
"Мелиоратор",
"Улица Абая",
"Улица Новостройка",
"Талгарская форель"
],

"7" : [
"Северная улица",
"3-я линия",
"Талгарские Дачи",
"17-я Дачная улица",
"Талгарские Дачи - АЗС",
"Талгарские Дачи - Школа",
"6-я Дачная улица",
"Абрикосовая улица",
"Талгарские дачи",
"Школьная улица",
"Улица Жибек Жолы",
"Кендала - Улица Жангельдина",
"Мечеть Кендала",
"Кендала - Улица Ахметова",
"Улица Ахметова",
"Строительный рынок",
"Автобаза",
"Магазин Елена",
"Школа №6",
"Улица Карасай батыра",
"Аптека",
"Спутник",
"Улица Некрасова",
"Промкомбинат",
"Улица Астана",
"Улица Туякбаева",
"Базар",
"Акимат",
"Автостанция",
"Талмед",
"Улица Бокина",
"Управление государственных доходов",
"Школа №2",
"Военкомат",
"Талгарский медицинский колледж",
"Талгарская центральная районная больница",
"Поликлиника",
"Ясли-сад №7",
"Школа №7",
"Цон",
"Школа №3",
"Улица Абая",
"Казахская улица",
"Село Арман",
"Улица Жангелдина",
"Улица Аманжолова",
"Улица Айманова",
"Алатауская улица",
"Микрорайон Арман"
],

"8" : [
"Актас",
"Центральная улица",
"16-я Дачная улица",
"Талгарские Дачи - АЗС",
"Талгарские Дачи - Школа",
"6-я Дачная улица",
"Абрикосовая улица",
"Талгарские дачи",
"Школьная улица",
"Улица Жибек Жолы",
"Кендала - Улица Жангельдина",
"Мечеть Кендала",
"Кендала - Улица Ахметова",
"Улица Ахметова",
"Строительный рынок",
"Автобаза",
"Магазин Елена",
"Школа № 6",
"Улица Карасай батыра",
"Аптека",
"Спутник",
"Улица Некрасова",
"Промкомбинат",
"Улица Астана",
"Улица Туякбаева",
"Базар",
"Акимат",
"Автостанция",
"Талмед",
"Улица Бокина",
"Управление государственных доходов",
"Школа №2",
"Военкомат",
"Талгарский медицинский колледж",
"Талгарская центральная районная больница",
"Поликлиника",
"Ясли-сад № 7",
"Школа № 7",
"Цон",
"Школа № 3",
"Улица Абая",
"Казахская улица",
"Центр фтизиопульмонологии",
"Ветинспекция",
"Центральное кладбище",
"Колонка",
"Улица Калдаякова",
"Улица Казыгурт",
"Школа № 44",
"Молочный комплекс № 1",
"Акдала"
],

"9" : [
"Талгар - Школа № 25",
"Поворот на мечеть Нуржау",
"Мечеть Нуржау",
"Улица Абылай хана",
"Улица Шакарима",
"Улица Айвазовского",
"Улица Достоевского",
"Улица Ыкыласа",
"Улица Курмангазы",
"Акимат",
"Улица Ломоносова",
"Управление государственных доходов",
"Цон",
"Улица Адильхана",
"Ясли-сад № 7",
"Поликлиника",
"Талгарская центральная районная больница",
"Талгарский медицинский колледж",
"Военкомат",
"Школа № 2",
"Улица Бокина",
"Талмед",
"Автостанция"
]
}
def write_route(x):
	if x in all_buses:
		print(all_buses[x])
	else:
		print("Такого маршрута нет")
def write_by_busstop(y):
	all=[]
	for number, stops in all_buses.items():
		if y in stops:
			all.append(number)
	if len(all) == 0:
		print("ты ввел неправильную остановку")
	else:
		print(all)
def transfer(x,y):
    first=[]
    second=[]

    for number, stops in all_buses.items():
        if x in stops:
            first.append(number)

        if y in stops:
            second.append(number)

    for bus1 in first:
        for bus2 in second:
            stops1 = set(all_buses[bus1])
            stops2 = set(all_buses[bus2])

            transfer_stops = stops1 & stops2

            if transfer_stops:
                print("нужна пересадка")
                print("сначала автобус", bus1)
                print("пересадка на остановке", list(transfer_stops))
                print("потом автобус", bus2)
                return
    print("маршрут не найден")
def generate(x,y):
	first=[]
	second=[]
	for number, stops in all_buses.items():
		if x in stops:
			first.append(number)
		if y in stops:
			second.append(number)
	over = set(first) & set(second)
	if len(over)>0 :
		print(over)
	else:
		print("нужна пересадка")
		transfer(x,y)
def show_all():
	print("полный список всех маршрутов и остановок")
	for number, stops in all_buses.items():
		print("Маршрут :",number,stops)
print("Список всех команд")
print("Напишите цифру 1, чтобы получить информацию об интересующем вас маршруте")
print("Напишите цифру 2, чтобы найти автобусы, которые проезжают через вашу остановку")
print("Напишите цифру 3, чтобы спланировать маршурут из остановки А до остановки Б")
print("Напишите цифру 4, чтобы увидеть список всех маршурутов и их остановок")
a=int(input())
if a == 1 :
	write_route(x=(input("введи номер интересующего тебя маршрута, только цирфа, без лишних символов")))
if a == 2 :
	write_by_busstop(y=input("введи название остановки строго также, как она записана в справочнике, учитывая каждый символ и то, какие буквы заглавные, а какие строчные"))
if a == 3 :
	generate(x=input("введи остановку где ты сейчас(нужно писать точно также, как она записана в спраочнике)"),y=input("введи остановку куда хочешь приехать"))
if a == 4:
	show_all()